---
kind: method
id: M:Autodesk.Revit.DB.HostObjAttributes.SetCompoundStructure(Autodesk.Revit.DB.CompoundStructure)
source: html/45f77d1a-c538-6fd2-7649-e461e66efbdd.htm
---
# Autodesk.Revit.DB.HostObjAttributes.SetCompoundStructure Method

Sets the compound structure of the element.

## Syntax (C#)
```csharp
public void SetCompoundStructure(
	CompoundStructure compoundStructure
)
```

## Parameters
- **compoundStructure** (`Autodesk.Revit.DB.CompoundStructure`)